salara1960/stm32f411/Src/main.c
						case key_ch: putMsg(msg_rst); break;//rst

						case key_eq: tmr_out = getTimer(_1ms); break;//out
					}
				}
			}
		}

		if (tmr_ired) {
			if (chkTimer(tmr_ired)) {
				tmr_ired = 0;
				resumeIRED();
				IRRED_LED();
			}
		}
#endif

		switch (getMsg()) {

		    case msg_adcReady:
		    {
		    	adcValue = (uint16_t)HAL_ADC_GetValue(portADC) & 0xfff;// * 0.80586;
		    	//
		    	if (VccAddVal(adcValue) == MAX_VCC_BUF) {//в окне накоплено MAX_VCC_BUF выборок -> фильтрация !
		    		uint16_t sum = 0;
		    		for (int8_t j = 0; j < MAX_VCC_BUF; j++) sum += VccBuf[j];
		    		sum /= MAX_VCC_BUF;
		    		VccF = (float)(sum * 0.80586) / 1000;
		    	}
		    	//
		    	startADC = 1;
		    }
		    break;
		    case msg_10ms:
		    	schMS++;
		    	//
		    	if (!setRTC) {
		    		setRTC = 1;
		    		set_Date(epoch);
		    		setSec(get_DateTime());
		    	}
		    	//
		    	if (!(schMS % (_100ms))) {// 100ms
		    		if (startADC) HAL_ADC_Start_IT(portADC);
		    		if (devError) ON_ERR_LED()
		    		         else OFF_ERR_LED()
#ifdef MIC_PRESENT
					if (tmrEXT3) {
						if (chkTimer(tmrEXT3)) {
							enEXT3 = 1;
							tmrEXT3 = 0;
						}
					}
#endif
		    	}
		    	//
		    	if (tmr_out) {
		    		if (chkTimer(tmr_out)) {
		    			tmr_out = 0;
		    			putMsg(msg_out);
		    		}
		    	}
		    	//
		    break;
		    case msg_sec:
		    	led_OnOff();
		    	//
		    	sec_to_str_time(line);
#if defined(SET_OLED_SPI)
	#ifdef SET_MPU
		    	if (!devError) sprintf(line+strlen(line), "\n  VCC:%.3fv", VccF);
		    	          else sprintf(line+strlen(line), "\n devError:0x%02X", devError);
		    	if (mpuPresent) {
		    		sprintf(line+strlen(line), "\n mpuTemp:%.2f%c\n", mpu_data.TEMP, gradus);
		    	} else {
		    		sprintf(line+strlen(line), "\n mpuTemp: ---\n");
		    	}
	#else
		    	sprintf(line+strlen(line), "\n  VCC:%.3fv\n devError:0x%02X\n", Vcc, devError);
	#endif
	#ifdef SET_BMx280
		    	sprintf(line+strlen(line), "  pres:%.2fmm\n  temp:%.2f%c\n", sensors.bmx_pres, sensors.bmx_temp, gradus);
		    	if (reg_id == BME280_SENSOR) sprintf(line+strlen(line), "  humi:%.2f%%\n", sensors.bmx_humi);
	#endif
		    	sprintf(line+strlen(line), " azimut:%.2f%c\n", compData.angleHMC, gradus);
		    	/*if (sfst) {
		    		sfst = 0;
		    		sprintf(line+strlen(line), "%s", devName);
		    		putMsg(msg_shiftEvent);
		    	}*/
		    	spi_ssd1306_text_xy(line, 2, 1);
#elif defined(SET_IPS)
		    	//
		    	//ST7789_Fill(0, 0, ST7789_WIDTH - 1, fntKey.height, WHITE);
		    	ST7789_WriteString(0, 0, mkLineCenter(line, ST7789_WIDTH / fntKey.width), fntKey, RED, WHITE);
		    	//
		    	line[0] = '\0';
	#ifdef SET_MPU
		    	if (!devError) sprintf(line+strlen(line), "\n    Vcc:%.3fv\n", VccF);
		    	          else sprintf(line+strlen(line), "\n devError:0x%02X\n", devError);
		    	if (mpuPresent) {
		    		sprintf(line+strlen(line), "   mpuTemp:%.2f^\n", mpu_data.TEMP);
		    		sprintf(line+strlen(line), "   mpuAccel:%d,%d,%d\n", mpu_data.xACCEL, mpu_data.yACCEL, mpu_data.zACCEL);
		    		sprintf(line+strlen(line), "   mpuGyro:%d,%d,%d\n", mpu_data.xGYRO, mpu_data.yGYRO, mpu_data.zGYRO);
		    	} else {
		    		sprintf(line+strlen(line), "   mpuTemp: ---\n");
		    	}
	#else
		    	sprintf(line+strlen(line), "VCC:%.3fv\n devError:0x%02X\n", Vcc, devError);
	#endif
	#ifdef SET_BMx280
		    	sprintf(line+strlen(line), "   pres:%.2fmm\n   temp:%.2f^\n", sensors.bmx_pres, sensors.bmx_temp);
		    	if (reg_id == BME280_SENSOR) sprintf(line+strlen(line), "   humi:%.2f%%\n", sensors.bmx_humi);
	#endif
		    	sprintf(line+strlen(line), "   azimut:%.2f^\n   temp2:%.2f^\n", compData.angleHMC, compData.tempHMC);

		    	ST7789_WriteString(0, tFont.height, line, tFont, WHITE, BLACK);
#endif
		    break;
			case msg_rxDone:
				Report(NULL, 0, stx);
				if ((uk = strstr(stx, "epoch=")) != NULL) {
					uk += 6;
					if (strlen(uk) >= 10) {
						uke = strchr(uk, ':');
						if (uke) {
							tZone = atoi(uke + 1);
							*uke = '\0';
						} else tZone = 0;
						uint32_t cep = atol(uk);
						if (cep > 0) set_Date((time_t)cep);
					}
				}
				else if (strstr(stx, "jtune_on") != NULL) {//key_100
					jtune = 1;
				} else if (strstr(stx, "jtune_off") != NULL) {//key_200
					jtune = 0;
				}
#ifdef SET_cJSON
				else if (strstr(stx, "cjson") != NULL) {//key_2
					outMode = cjsonMode;
				}
#endif
				else if (strstr(stx, "json") != NULL) {//key_1
					outMode = jsonMode;
				} else if (strstr(stx, "text") != NULL) {//key_0
					outMode = textMode;
				}
				else if (strstr(stx, "dbg_on") != NULL) {//key_3
					outDebug = 1;
				} else if (strstr(stx, "dbg_off") != NULL) {//key_4
					outDebug = 0;
				} else if (strstr(stx, "get") != NULL) {//key_eq
					//putMsg(msg_out);
					tmr_out = getTimer(_1ms);
				} else if (strstr(stx, "rst") != NULL) {//key_ch
					putMsg(msg_rst);
				} else if ((uk = strstr(stx, "period=")) != NULL) {//key_minus : -100ms, key_plus : +100ms
					int val = atoi(uk + 7);
					if ((val > 0) && (val <= 30000)) cikl_out = val;
				}
#ifdef SET_OLED_SPI
				else if (strstr(stx, "shift") != NULL) {
					if (shiftStart == OLED_CMD_SHIFT_STOP) shiftStart = OLED_CMD_SHIFT_START;
					                                  else shiftStart = OLED_CMD_SHIFT_STOP;
					putMsg(msg_shiftEvent);
				}
#endif
			break;
			case msg_rst:
				HAL_Delay(800);
				NVIC_SystemReset();
			break;
			case msg_shiftEvent:
#ifdef SET_OLED_SPI
				spi_ssd1306_shift(shiftLine, shiftStart);
				if (shiftStart == OLED_CMD_SHIFT_STOP) {
					spi_ssd1306_clear_line(shiftLine);
					spi_ssd1306_text_xy(devName, 1, shiftLine);
				}
#endif
			break;
			case msg_out:
				tmr_out = getTimer(cikl_out);
				uint8_t with_dt = 0;
				if (outMode == textMode) with_dt = 1;
				Report(NULL, with_dt, "%s\r\n", printOut(tmp));
			break;
			case msg_iMPU:
#ifdef SET_MPU
				cntMPU++;
				//
	#ifdef SET_MPU_INTERRUPT
					mpuDisableInterrupts();
					mpuStatus = mpuReadStatus();
					//
					siCmd = msg_mpuAllRead;
					putMsg(msg_i2c);
	#endif
				//
#endif
			break;
#ifndef SET_COMPAS_BLOCK
			case msg_i2c:
				switch (siCmd) {
					case msg_startCompas:
						if (chkTimer(next)) {
							//
							//STROB_DOWN();
							//
							msBegin = HAL_GetTick();
							next = 0;
							procCompas();
							//
						} else {
							putMsg(msg_i2c);
						}
					break;
					case msg_getCompas:
						//
						if (CompAddVal(COPMAS_CalcAngle()) == MAX_COMP_BUF) {//в окне накоплено MAX_VCC_BUF выборок -> фильтрация !
							float sum = 0;
							for (int8_t j = 0; j < MAX_COMP_BUF; j++) sum += CompBuf[j];
							sum /= MAX_COMP_BUF;
							compData.angleHMC = sum;
						}
						//
						siCmd = msg_empty;
						next = 0;
						putMsg(msg_nextSens);
						//
					break;
					case msg_rdyTest:
						//
						i2c_test_ready_bmx280(&info_bmp280);
						//
					break;
					case msg_rdyStat:
						bStat = i2c_getStat_bmx280();
						if (!bStat) {
							errStatCnt++;
							if (errStatCnt < 10) {
								siCmd = msg_rdyTest;
								putMsg(msg_i2c);
							} else {
								devError |= devI2C1;
								errStatCnt = 0;
							}
							break;
						}
						//
						if (i2c_read_data_bmx280(data_rdx, d_size) != HAL_OK) devError |= devI2C1;
						//
					break;
					case msg_readBMX:
						//
						if (!bmxCalibr) bmx280_readCalibr1Data(reg_id);//goto read calibration data part 1
						else {
							bmx280_CalcAll(&sensors, reg_id);
#ifdef SET_MPU
							if (mpuPresent) {
								//
	#ifdef SET_MPU_INTERRUPT
								mpuEnableInterrupts();
	#else
								siCmd = msg_mpuAllRead;
								putMsg(msg_i2c);
	#endif
							} else putMsg(msg_endNext);
#else
							putMsg(msg_endNext);
#endif
						}
						//
					break;
					case msg_calibr1Done:
						//
						bmx280_calcCalibr1Data(reg_id);
						if (reg_id == BME280_SENSOR) {
							bmx280_readCalibr2Data(reg_id);
						} else {
							bmx280_CalcAll(&sensors, reg_id);
#ifdef SET_MPU
							if (mpuPresent) {
								siCmd = msg_mpuAllRead;
								putMsg(msg_i2c);
							} else putMsg(msg_endNext);
#else
							putMsg(msg_endNext);
#endif
						}
						//
					break;
					case msg_calibr2Done:
						//
						if (reg_id == BME280_SENSOR) bmx280_calcCalibr2Data();
						bmx280_CalcAll(&sensors, reg_id);
						bmxCalibr = true;
#ifdef SET_MPU
						if (mpuPresent) {
							//
	#ifdef SET_MPU_INTERRUPT
							mpuEnableInterrupts();
	#else
							siCmd = msg_mpuAllRead;
							putMsg(msg_i2c);
	#endif
						} else putMsg(msg_endNext);
#else
						putMsg(msg_endNext);
#endif
						//
					break;
#ifdef SET_MPU
					case msg_mpuAllRead:
						//
	#ifndef SET_MPU_INTERRUPT
						mpuStatus = mpuReadStatus();//!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
	#endif
						//
						mpuAllRead();//start read all data from adr 0x3b....(14 bytes)
						//
					break;
					case msg_mpuAllReady:
						//
						mpuConvData();
						//STROB_UP();
						putMsg(msg_endNext);
						//
					break;
#endif
				}
			break;
#else
			case msg_startCompas:
			{
				if (chkTimer(next)) {
					//STROB_DOWN();
					//
					msBegin = HAL_GetTick();
					next = 0;
					procCompas();

					//
					if (CompAddVal(COPMAS_CalcAngle()) == MAX_COMP_BUF) {//в окне накоплено MAX_VCC_BUF выборок -> фильтрация !
						float sum = 0;
						for (int8_t j = 0; j < MAX_COMP_BUF; j++) sum += CompBuf[j];
						sum /= MAX_COMP_BUF;
						compData.angleHMC = sum;
					}
					//
					putMsg(msg_nextSens);
					//
					//STROB_UP();
				} else putMsg(msg_startCompas);
			}
			break;
#endif
			case msg_nextSens:
				if (chkTimer(next)) {
					//STROB_DOWN();
					//
#ifdef SET_BMx280
					//
					if (i2c_test_bmx280(&info_bmp280, reg_id) != HAL_OK) devError |= devI2C1;
					//next = getTimer(_1ms);
	#ifdef SET_COMPAS_BLOCK
					bStat = i2c_getStat_bmx280();
					if (!bStat) {
						next = getTimer(_1ms);
						putMsg(msg_nextSens);
						break;
					}
					//
					if (i2c_read_bmx280(BMP280_REG_PRESSURE, data_rdx, d_size) == HAL_OK) {
						//
						if (!bmxCalibr) bmxCalibr = bmx280_readCalibrationData(reg_id);
						//
						bmx280_CalcAll(&sensors, reg_id);
						//
					} else devError |= devI2C1;
					putMsg(msg_endNext);
	#endif
#endif
					//STROB_UP();
				} else putMsg(msg_nextSens);
			break;
			case msg_endNext:
				//
				//
				//
				msCnt = HAL_GetTick() - msBegin;
				if (msCnt < msPeriod) {
					msCnt = msPeriod - msCnt;
				} else {
					msCnt -= msPeriod;
				}
				if (!msCnt) msCnt++;
				next = getTimer(msCnt);
				//
#ifdef SET_COMPAS_BLOCK
				evt = msg_startCompas;
				siCmd = msg_empty;
#else
				evt = msg_i2c;
				siCmd = msg_startCompas;
#endif
				putMsg(evt);
				//
				//STROB_UP();
			break;
		}

    /* USER CODE END WHILE */

